# Kaggle Titanic

This is of course the classic titanic Kaggle challenge. I am doing this as a first step towards more challenging and interesting projects that I will.

In [1]:
import pandas as pd
import numpy as np

First, I will load the datasets and explore.

In [2]:
data = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")
test_ids = test["PassengerId"]

print(data.Embarked.value_counts())

total_missing_cells = data.Embarked.isna().sum()
print("Total missing cells:", total_missing_cells)

data.head(5)

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64
Total missing cells: 2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

I will choose which columns to include in my ML model, as well as clean the data.

In [3]:
def clean(data):
    # drop certain columns

    
    data = data.drop(["Ticket", "Cabin", "Name", "PassengerId"], axis=1)
    
    # cols we want to check out
    cols = ["SibSp", "Parch", "Fare", "Age"]
    for col in cols:
        data[col].fillna(data[col].median(), inplace=True)
    
    

    
    # we label those who we don't know where they embarked from with U = Unknown
    data.Embarked.fillna("U", inplace=True)
    

    return data

data = clean(data)
test = clean(test)

print(data.Embarked.value_counts())
total_missing_cells = data.Embarked.isna().sum()
print("Total missing cells:", total_missing_cells)

Embarked
S    644
C    168
Q     77
U      2
Name: count, dtype: int64
Total missing cells: 0

In [4]:
data.head(5)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

The data looks better now! But we also need to convert the "Sex" and "Embarked" columns to numerical values.

In [5]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()

cols = ["Sex", "Embarked"]

for col in cols:
    data[col] = le.fit_transform(data[col])
    test[col] = le.fit_transform(test[col])
    
    # i had a bug where it wasn't mapping the U's, so I manually add it
    if col == "Embarked" and 'U' not in le.classes_:
        le.classes_ = np.append(le.classes_, 'U')

    print(le.classes_)

data.head(5)
test.head(5)

['female' 'male']
['C' 'Q' 'S' 'U']

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  34.5      0      0   7.8292         1
1       3    0  47.0      1      0   7.0000         2
2       2    1  62.0      0      0   9.6875         1
3       3    1  27.0      0      0   8.6625         2
4       3    0  22.0      1      1  12.2875         2

The data seems cleaned up now, so let's move onto the model creation.

In [6]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

y = data["Survived"]
X = data.drop("Survived", axis=1)

X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=0.2, random_state=42)

In [7]:
clf = LogisticRegression(random_state=0, max_iter=1000).fit(X_train, y_train)

We have made the model, so we will now use it on the validation dataset to test accuracy.

In [8]:
predictions = clf.predict(X_val)

from sklearn.metrics import accuracy_score
accuracy_score(y_val, predictions)

0.8100558659217877

The model did ok. Now, I will make predictions on the prediction set so submit to Kaggle.

In [9]:
submission_preds = clf.predict(test)

In [10]:
df = pd.DataFrame({"PassengerId":test_ids.values,"Survived":submission_preds} )

In [11]:
df.to_csv("submission.csv", index=False)